NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l15_application.svd
          <register>
            <name>STATUS</name>
            <description>Status register.</description>
            <addressOffset>0x030</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TESTDATABUSY</name>
                <description>High when data written to TestData register is being processed.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>STATE</name>
                <description>State of the control FSM:</description>
                <lsb>1</lsb>
                <msb>3</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RESET</name>
                    <description>Reset</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STARTUP</name>
                    <description>Startup</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IDLERON</name>
                    <description>Idle (Rings On)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IDLEROFF</name>
                    <description>Idle (Rings Off)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FILLFIFO</name>
                    <description>Fill FIFO</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ERROR</name>
                    <description>Error</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REPFAIL</name>
                <description>NIST-800-90B repetition Count Test interrupt status.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PROPFAIL</name>
                <description>NIST-800-90B adaptive Proportion Test (1024-sample window) interrupt status.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>FULLINT</name>
                <description>FIFO full status.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>PREINT</name>
                <description>AIS31 preliminary noise alarm interrupt status.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>ALMINT</name>
                <description>AIS31 noise alarm interrupt status.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>STARTUPFAIL</name>
                <description>Start-up test failure.</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>FIFOACCFAIL</name>
                <description>Set when a FIFO data read is performed while the NDRNG is disabled AND has its FIFO empty (FIFOLevel = 0).</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INITWAITVAL</name>
            <description>Initial wait counter value.</description>
            <addressOffset>0x034</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000FFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITWAITVAL</name>
                <description>Number of clock cycles to wait before sampling data from the noise source.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DISABLEOSC[%s]</name>
            <description>Description collection: Disable oscillator rings #n*32 to #((n+1)*32)-1.</description>
            <addressOffset>0x038</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DISABLEOSC</name>
                <description>Disable oscillator rings #n*32 to #((n+1)*32)-1.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SWOFFTMRVAL</name>
            <description>Switch off timer value.</description>
            <addressOffset>0x040</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000FFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SWOFFTMRVAL</name>
                <description>Number of clk cycles to wait before stopping the rings after the FIFO is full.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CLKDIV</name>
            <description>Sample clock divider.</description>
            <addressOffset>0x044</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CLKDIV</name>
                <description>Sample clock divider.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AIS31CONF0</name>
            <description>AIS31 configuration register 0.</description>
            <addressOffset>0x048</addressOffset>
            <access>read-write</access>
            <resetValue>0x43401040</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STARTUPTHRESHOLD</name>
                <description>Start-up test threshold.</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>ONLINETHRESHOLD</name>
                <description>Online threshold.</description>
                <lsb>16</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AIS31CONF1</name>
            <description>AIS31 configuration register 1.</description>
            <addressOffset>0x04C</addressOffset>
            <access>read-write</access>
            <resetValue>0x03C00680</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ONLINEREPTHRESHOLD</name>
                <description>Online repeat threshold.</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>HEXPECTEDVALUE</name>
                <description>Expected history value.</description>
                <lsb>16</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AIS31CONF2</name>
            <description>AIS31 configuration register 2.</description>
            <addressOffset>0x050</addressOffset>
            <access>read-write</access>
            <resetValue>0x04400340</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HMIN</name>
                <description>Minimum allowed history value.</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>HMAX</name>
                <description>Maximum allowed history value.</description>
                <lsb>16</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AIS31STATUS</name>
            <description>AIS31 status register.</description>
            <addressOffset>0x054</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NUMPRELIMALARMS</name>
                <description>Number of preliminary noise alarms since counter was last cleared.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>PRELIMNOISEALARMRNG</name>
                <description>Last preliminary noise alarm occurred due to history value out of range.</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>PRELIMNOISEALARMREP</name>
                <description>Last preliminary noise alarm occurred due to consecutive high Χ**2.</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HWCONFIG</name>
            <description>Hardware configuration register.</description>
            <addressOffset>0x058</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000337</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NUMBOFRINGS</name>
                <description>Generic g_NumRings value.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>AIS31</name>
                <description>Generic g_AIS31 value.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>AIS31FULL</name>
                <description>Generic g_AIS31Full value.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x10</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>FIFO[%s]</name>
            <description>Description collection: FIFO data</description>
            <addressOffset>0x080</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>FIFO data</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PK</name>
          <description>Unspecified</description>
          <headerStructName>CRACENCORE_PK</headerStructName>
          <access>read-write</access>
          <addressOffset>0x2000</addressOffset>
          <register>
            <name>POINTERS</name>
            <description>Pointers register.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OPPTRA</name>
                <description>When executing primitive arithmetic operations, this pointer defines where operand A is located in memory (location 0x0 to 0xF).</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>OPPTRB</name>
                <description>When executing primitive arithmetic operations, this pointer defines where operand B is located in memory (location 0x0 to 0xF).</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>OPPTRC</name>
                <description>When executing primitive arithmetic operations, this pointer defines the location (0x0 to 0xF) where the result will be stored in memory.</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>OPPTRN</name>
                <description>When executing primitive arithmetic operations, this pointer defines the location where the modulus is located in memory (location 0x0 to 0xF).</description>
                <lsb>24</lsb>
                <msb>27</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>COMMAND</name>
            <description>Command register.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000000F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OPEADDR</name>
                <description>This field defines the operation to be performed.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>FIELDF</name>
                <description>0: Field is GF(p) 1: Field is GF(2**m)</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>OPBYTESM1</name>
                <description>This field defines the size (= number of bytes minus one) of the operands for the current operation.</description>
                <lsb>8</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>RANDMOD</name>
                <description>Enable randomization of modulus (counter-measure).</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>SELCURVE</name>
                <description>Enable accelerator for specific curve modulus:</description>
                <lsb>20</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOACCEL</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>P256</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>P384</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>P521</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>P192</name>
                    <description>Unspecified</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CURVE25519</name>
                    <description>Unspecified</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ED25519</name>
                    <description>Unspecified</description>
                    <value>0x6</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RANDKE</name>
                <description>Enable randomization of exponent/scalar (counter-measure).</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>RANDPROJ</name>
                <description>Enable randomization of projective coordinates (counter-measure).</description>
                <lsb>25</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>EDWARDS</name>
                <description>Enable Edwards curve.</description>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>SWAPBYTES</name>
                <description>Swap the bytes on AHB interface:</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NATIVE</name>
                    <description>Native format (little endian).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SWAPPED</name>
                    <description>Byte swapped (big endian).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FLAGA</name>
                <description>Flag A.</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>FLAGB</name>
                <description>Flag B.</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>CALCR2</name>
                <description>This bit indicates if the IP has to calculate R**2 mod N for the next operation.</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NRECALCULATE</name>
                    <description>don't recalculate R² mod N</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RECALCULATE</name>
                    <description>re-calculate R² mod N</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CONTROL</name>
            <description>Command register.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>START</name>
                <description>Writing a 1 starts the processing.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>CLEARIRQ</name>
                <description>Writing a 1 clears the IRQ output.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>Status register.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRORFLAGS</name>
                <description>These bits indicate an error condition.</description>
                <lsb>4</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PKBUSY</name>
                <description>This bit reflects the BUSY output value.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>INTRPTSTATUS</name>
                <description>This bit reflects the IRQ output value.</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>FAILPTR</name>
                <description>These bits indicate which data location generated the error flag.</description>
                <lsb>24</lsb>
                <msb>28</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMER</name>
            <description>Timer register.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TIMER</name>
                <description>Number of core clock cycles.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
