NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l15_application.svd
        <register>
          <name>TRCBBCTLR</name>
          <description>Controls which regions in the memory map are enabled to use branch broadcasting. Might ignore writes when the trace unit is enabled or not idle. Must be programmed if TRCCONFIGR.BB == 1.</description>
          <addressOffset>0x3C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RANGE_0</name>
              <description>Address range field. Selects which address range comparator pairs are in use with branch broadcasting. 
        Each field represents an address range comparator pair, so field[0] controls the selection of address range comparator pair 0.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address range that address range comparator pair 0 defines, is not selected.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address range that address range comparator pair n defines, is selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGE_1</name>
              <description>Address range field. Selects which address range comparator pairs are in use with branch broadcasting. 
        Each field represents an address range comparator pair, so field[1] controls the selection of address range comparator pair 1.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address range that address range comparator pair 1 defines, is not selected.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address range that address range comparator pair n defines, is selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGE_2</name>
              <description>Address range field. Selects which address range comparator pairs are in use with branch broadcasting. 
        Each field represents an address range comparator pair, so field[2] controls the selection of address range comparator pair 2.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address range that address range comparator pair 2 defines, is not selected.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address range that address range comparator pair n defines, is selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGE_3</name>
              <description>Address range field. Selects which address range comparator pairs are in use with branch broadcasting. 
        Each field represents an address range comparator pair, so field[3] controls the selection of address range comparator pair 3.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address range that address range comparator pair 3 defines, is not selected.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address range that address range comparator pair n defines, is selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGE_4</name>
              <description>Address range field. Selects which address range comparator pairs are in use with branch broadcasting. 
        Each field represents an address range comparator pair, so field[4] controls the selection of address range comparator pair 4.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address range that address range comparator pair 4 defines, is not selected.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address range that address range comparator pair n defines, is selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGE_5</name>
              <description>Address range field. Selects which address range comparator pairs are in use with branch broadcasting. 
        Each field represents an address range comparator pair, so field[5] controls the selection of address range comparator pair 5.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address range that address range comparator pair 5 defines, is not selected.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address range that address range comparator pair n defines, is selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGE_6</name>
              <description>Address range field. Selects which address range comparator pairs are in use with branch broadcasting. 
        Each field represents an address range comparator pair, so field[6] controls the selection of address range comparator pair 6.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address range that address range comparator pair 6 defines, is not selected.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address range that address range comparator pair n defines, is selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGE_7</name>
              <description>Address range field. Selects which address range comparator pairs are in use with branch broadcasting. 
        Each field represents an address range comparator pair, so field[7] controls the selection of address range comparator pair 7.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address range that address range comparator pair 7 defines, is not selected.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address range that address range comparator pair n defines, is selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCTRACEIDR</name>
          <description>Sets the trace ID for instruction trace. If data trace is enabled then it also sets the trace ID for data trace, to (trace ID for instruction trace) + 1. This register must always be programmed as part of trace unit initialization. Might ignore writes when the trace unit is enabled or not idle.</description>
          <addressOffset>0x40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRACEID</name>
              <description>Trace ID field. Sets the trace ID value for instruction trace. Bit[0] must be zero if data trace is enabled. If data trace is enabled then a trace unit sets the trace ID for data trace, to TRACEID+1.</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCQCTLR</name>
          <description>Controls when Q elements are enabled. Might ignore writes when the trace unit is enabled or not idle. This register must be programmed if it is implemented and TRCCONFIGR.QE is set to any value other than 0b00.</description>
          <addressOffset>0x44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RANGE_0</name>
              <description>Specifies the address range comparators to be used for controlling Q elements.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Address range comparator 0 is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Address range comparator 0 is selected for use.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGE_1</name>
              <description>Specifies the address range comparators to be used for controlling Q elements.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Address range comparator 1 is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Address range comparator 1 is selected for use.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGE_2</name>
              <description>Specifies the address range comparators to be used for controlling Q elements.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Address range comparator 2 is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Address range comparator 2 is selected for use.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGE_3</name>
              <description>Specifies the address range comparators to be used for controlling Q elements.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Address range comparator 3 is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Address range comparator 3 is selected for use.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGE_4</name>
              <description>Specifies the address range comparators to be used for controlling Q elements.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Address range comparator 4 is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Address range comparator 4 is selected for use.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGE_5</name>
              <description>Specifies the address range comparators to be used for controlling Q elements.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Address range comparator 5 is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Address range comparator 5 is selected for use.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGE_6</name>
              <description>Specifies the address range comparators to be used for controlling Q elements.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Address range comparator 6 is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Address range comparator 6 is selected for use.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGE_7</name>
              <description>Specifies the address range comparators to be used for controlling Q elements.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Address range comparator 7 is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Address range comparator 7 is selected for use.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Selects whether the address range comparators selected by the RANGE field indicate
address ranges where the trace unit is permitted to generate Q elements or address ranges
where the trace unit is not permitted to generate Q elements:</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Exclude</name>
                  <description>Exclude mode. The address range comparators selected by the RANGE field
indicate address ranges where the trace unit cannot generate Q elements. If no
ranges are selected, Q elements are permitted across the entire memory map.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Include</name>
                  <description>Include mode. The address range comparators selected by the RANGE field
indicate address ranges where the trace unit can generate Q elements. If all the
implemented bits in RANGE are set to 0 then Q elements are disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
