NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l15_application.svd
        <register>
          <name>ERRORSTATUS</name>
          <description>Error status</description>
          <addressOffset>0x404</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ERRORSTATUS</name>
              <description>Error status when the ERROR event is generated</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoError</name>
                  <description>No errors have occurred</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PrematureInptrEnd</name>
                  <description>End of INPTR job list before CCM data structure was read.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PrematureOutptrEnd</name>
                  <description>End of OUTPTR job list before CCM data structure was read.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EncryptionTooSlow</name>
                  <description>Encryption of the unencrypted CCM data structure did not complete in time.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DmaError</name>
                  <description>Bus error during DMA access.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <description>Enable</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable CCM</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>Operation mode</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>The mode of operation to be used. The settings in this register apply when the CRYPT task is triggered.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Encryption</name>
                  <description>AES CCM packet encryption mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Decryption</name>
                  <description>Deprecated enumerator -  This mode will run CCM decryption in the speed of the DATARATE field.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FastDecryption</name>
                  <description>AES CCM decryption mode.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PROTOCOL</name>
              <description>Protocol and packet format selection</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ble</name>
                  <description>Bluetooth Low Energy packet format</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ieee802154</name>
                  <description>802.15.4 packet format</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATARATE</name>
              <description>Radio data rate that the CCM shall run synchronous with</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>125Kbit</name>
                  <description>125 Kbps</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>250Kbit</name>
                  <description>250 Kbps</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500Kbit</name>
                  <description>500 Kbps</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1Mbit</name>
                  <description>1 Mbps</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2Mbit</name>
                  <description>2 Mbps</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4Mbit</name>
                  <description>4 Mbps</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MACLEN</name>
              <description>CCM MAC length (bytes)</description>
              <lsb>24</lsb>
              <msb>26</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M0</name>
                  <description>M = 0 This is a special case for CCM* where encryption is required but not authentication</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4</name>
                  <description>M = 4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M6</name>
                  <description>M = 6</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M8</name>
                  <description>M = 8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M10</name>
                  <description>M = 10</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M12</name>
                  <description>M = 12</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M14</name>
                  <description>M = 14</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M16</name>
                  <description>M = 16</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>KEY</name>
          <description>Unspecified</description>
          <headerStructName>CCM_KEY</headerStructName>
          <access>read-write</access>
          <addressOffset>0x510</addressOffset>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>VALUE[%s]</name>
            <description>Description collection: 128-bit AES key</description>
            <addressOffset>0x000</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VALUE</name>
                <description>AES 128-bit key value, bits (32*(i+1))-1 : (32*i)</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>NONCE</name>
          <description>Unspecified</description>
          <headerStructName>CCM_NONCE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x520</addressOffset>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>VALUE[%s]</name>
            <description>Description collection: 13-byte NONCE vector Only the lower 13 bytes are used</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VALUE</name>
                <description>NONCE value, bits (32*(n+1))-1 : (32*n)</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>IN</name>
          <description>IN EasyDMA channel</description>
          <headerStructName>CCM_IN</headerStructName>
          <access>read-write</access>
          <addressOffset>0x530</addressOffset>
          <register>
            <name>PTR</name>
            <description>Input pointer Points to a job list containing unencrypted CCM data structure in Encryption mode Points to a job list containing encrypted CCM data structure in Decryption mode</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PTR</name>
                <description>Input pointer</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>OUT</name>
          <description>OUT EasyDMA channel</description>
          <headerStructName>CCM_OUT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x538</addressOffset>
          <register>
            <name>PTR</name>
            <description>Output pointer Points to a job list containing encrypted CCM data structure in Encryption mode Points to a job list containing decrypted CCM data structure in Decryption mode</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PTR</name>
                <description>Output pointer</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>RATEOVERRIDE</name>
          <description>Data rate override setting.</description>
          <addressOffset>0x544</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RATEOVERRIDE</name>
              <description>Data rate override setting.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>125Kbit</name>
                  <description>125 Kbps</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500Kbit</name>
                  <description>500 Kbps</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1Mbit</name>
                  <description>1 Mbps</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2Mbit</name>
                  <description>2 Mbps</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4Mbit</name>
                  <description>4 Mbps</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADATAMASK</name>
          <description>CCM adata mask.</description>
          <addressOffset>0x548</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000E3</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADATAMASK</name>
              <description>CCM adata mask.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
