NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l15_application.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM00_NS">
      <name>GLOBAL_SPIM00_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 1</description>
      <baseAddress>0x5004A000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL00</name>
        <value>74</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS00_NS">
      <name>GLOBAL_SPIS00_S</name>
      <description>SPI Slave 1</description>
      <baseAddress>0x5004A000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM00_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL00</name>
        <value>74</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE00_NS">
      <name>GLOBAL_UARTE00_S</name>
      <description>UART with EasyDMA 1</description>
      <baseAddress>0x5004A000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM00_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL00</name>
        <value>74</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GLOBAL_GLITCHDET_S</name>
      <description>Voltage glitch detectors</description>
      <baseAddress>0x5004B000</baseAddress>
      <headerStructName>GLITCHDET</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>GLITCHDET</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>CONFIG</name>
          <description>Configuration for glitch detector</description>
          <addressOffset>0x5A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable glitch detector</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable glitch detector</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable glitch detector</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Glitch detector mode</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HighPassFilter</name>
                  <description>High pass filter mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CapDiv</name>
                  <description>Cap divider mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_RRAMC_S</name>
      <description>RRAM controller GLITCH detector</description>
      <baseAddress>0x5004B000</baseAddress>
      <alternatePeripheral>GLOBAL_GLITCHDET_S</alternatePeripheral>
      <headerStructName>RRAMC</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RRAMC</name>
        <value>75</value>
      </interrupt>
      <groupName>RRAMC</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_WAKEUP</name>
          <description>Wakeup the RRAM from low power mode</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_WAKEUP</name>
              <description>Wakeup the RRAM from low power mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_CLRWRITEBUF</name>
          <description>Clear internal write-buffer</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_CLRWRITEBUF</name>
              <description>Clear internal write-buffer</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_COMMITWRITEBUF</name>
          <description>Commits the data stored in internal write-buffer to RRAM</description>
          <addressOffset>0x008</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_COMMITWRITEBUF</name>
              <description>Commits the data stored in internal write-buffer to RRAM</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_WAKEUP</name>
          <description>Subscribe configuration for task WAKEUP</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task WAKEUP will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_CLRWRITEBUF</name>
          <description>Subscribe configuration for task CLRWRITEBUF</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task CLRWRITEBUF will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_COMMITWRITEBUF</name>
          <description>Subscribe configuration for task COMMITWRITEBUF</description>
          <addressOffset>0x088</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task COMMITWRITEBUF will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_WOKENUP</name>
          <description>RRAMC is woken up from low power mode</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_WOKENUP</name>
              <description>RRAMC is woken up from low power mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_READY</name>
          <description>RRAMC is ready</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_READY</name>
              <description>RRAMC is ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_READYNEXT</name>
          <description>Ready to accept a new write operation</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_READYNEXT</name>
              <description>Ready to accept a new write operation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_ACCESSERROR</name>
          <description>RRAM access error</description>
          <addressOffset>0x10C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_ACCESSERROR</name>
              <description>RRAM access error</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_WOKENUP</name>
          <description>Publish configuration for event WOKENUP</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event WOKENUP will publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Enable or disable interrupt</description>
          <addressOffset>0x300</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>WOKENUP</name>
              <description>Enable or disable interrupt for event WOKENUP</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>READY</name>
              <description>Enable or disable interrupt for event READY</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>READYNEXT</name>
              <description>Enable or disable interrupt for event READYNEXT</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACCESSERROR</name>
              <description>Enable or disable interrupt for event ACCESSERROR</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Enable interrupt</description>
          <addressOffset>0x304</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>WOKENUP</name>
              <description>Write '1' to enable interrupt for event WOKENUP</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>READY</name>
              <description>Write '1' to enable interrupt for event READY</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>READYNEXT</name>
              <description>Write '1' to enable interrupt for event READYNEXT</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACCESSERROR</name>
              <description>Write '1' to enable interrupt for event ACCESSERROR</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
